car-hacking-village/DC33_CHV_Badge_Firmware/s32k148/S32K148_wrapped.h
#define SAI_RCR_MF(x)                            (((uint32_t)(((uint32_t)(x))<<SAI_RCR_MF_SHIFT))&SAI_RCR_MF_MASK)
#define SAI_RCR_SYWD_MASK                        0x1F00u
#define SAI_RCR_SYWD_SHIFT                       8u
#define SAI_RCR_SYWD_WIDTH                       5u
#define SAI_RCR_SYWD(x)                          (((uint32_t)(((uint32_t)(x))<<SAI_RCR_SYWD_SHIFT))&SAI_RCR_SYWD_MASK)
#define SAI_RCR_FBT_MASK                         0x1F00u
#define SAI_RCR_FBT_SHIFT                        8u
#define SAI_RCR_FBT_WIDTH                        5u
#define SAI_RCR_FBT(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_FBT_SHIFT))&SAI_RCR_FBT_MASK)
#define SAI_RCR_W0W_MASK                         0x1F0000u
#define SAI_RCR_W0W_SHIFT                        16u
#define SAI_RCR_W0W_WIDTH                        5u
#define SAI_RCR_W0W(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_W0W_SHIFT))&SAI_RCR_W0W_MASK)
#define SAI_RCR_FRSZ_MASK                        0xF0000u
#define SAI_RCR_FRSZ_SHIFT                       16u
#define SAI_RCR_FRSZ_WIDTH                       4u
#define SAI_RCR_FRSZ(x)                          (((uint32_t)(((uint32_t)(x))<<SAI_RCR_FRSZ_SHIFT))&SAI_RCR_FRSZ_MASK)
#define SAI_RCR_RCE_MASK                         0xF0000u
#define SAI_RCR_RCE_SHIFT                        16u
#define SAI_RCR_RCE_WIDTH                        4u
#define SAI_RCR_RCE(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_RCE_SHIFT))&SAI_RCR_RCE_MASK)
#define SAI_RCR_BCD_MASK                         0x1000000u
#define SAI_RCR_BCD_SHIFT                        24u
#define SAI_RCR_BCD_WIDTH                        1u
#define SAI_RCR_BCD(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_BCD_SHIFT))&SAI_RCR_BCD_MASK)
#define SAI_RCR_CFR_MASK                         0xF000000u
#define SAI_RCR_CFR_SHIFT                        24u
#define SAI_RCR_CFR_WIDTH                        4u
#define SAI_RCR_CFR(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_CFR_SHIFT))&SAI_RCR_CFR_MASK)
#define SAI_RCR_FPACK_MASK                       0x3000000u
#define SAI_RCR_FPACK_SHIFT                      24u
#define SAI_RCR_FPACK_WIDTH                      2u
#define SAI_RCR_FPACK(x)                         (((uint32_t)(((uint32_t)(x))<<SAI_RCR_FPACK_SHIFT))&SAI_RCR_FPACK_MASK)
#define SAI_RCR_WNW_MASK                         0x1F000000u
#define SAI_RCR_WNW_SHIFT                        24u
#define SAI_RCR_WNW_WIDTH                        5u
#define SAI_RCR_WNW(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_WNW_SHIFT))&SAI_RCR_WNW_MASK)
#define SAI_RCR_BCP_MASK                         0x2000000u
#define SAI_RCR_BCP_SHIFT                        25u
#define SAI_RCR_BCP_WIDTH                        1u
#define SAI_RCR_BCP(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_BCP_SHIFT))&SAI_RCR_BCP_MASK)
#define SAI_RCR_MSEL_MASK                        0xC000000u
#define SAI_RCR_MSEL_SHIFT                       26u
#define SAI_RCR_MSEL_WIDTH                       2u
#define SAI_RCR_MSEL(x)                          (((uint32_t)(((uint32_t)(x))<<SAI_RCR_MSEL_SHIFT))&SAI_RCR_MSEL_MASK)
#define SAI_RCR_FCOMB_MASK                       0xC000000u
#define SAI_RCR_FCOMB_SHIFT                      26u
#define SAI_RCR_FCOMB_WIDTH                      2u
#define SAI_RCR_FCOMB(x)                         (((uint32_t)(((uint32_t)(x))<<SAI_RCR_FCOMB_SHIFT))&SAI_RCR_FCOMB_MASK)
#define SAI_RCR_BCI_MASK                         0x10000000u
#define SAI_RCR_BCI_SHIFT                        28u
#define SAI_RCR_BCI_WIDTH                        1u
#define SAI_RCR_BCI(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_BCI_SHIFT))&SAI_RCR_BCI_MASK)
#define SAI_RCR_FCONT_MASK                       0x10000000u
#define SAI_RCR_FCONT_SHIFT                      28u
#define SAI_RCR_FCONT_WIDTH                      1u
#define SAI_RCR_FCONT(x)                         (((uint32_t)(((uint32_t)(x))<<SAI_RCR_FCONT_SHIFT))&SAI_RCR_FCONT_MASK)
#define SAI_RCR_BCS_MASK                         0x20000000u
#define SAI_RCR_BCS_SHIFT                        29u
#define SAI_RCR_BCS_WIDTH                        1u
#define SAI_RCR_BCS(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RCR_BCS_SHIFT))&SAI_RCR_BCS_MASK)
#define SAI_RCR_SYNC_MASK                        0xC0000000u
#define SAI_RCR_SYNC_SHIFT                       30u
#define SAI_RCR_SYNC_WIDTH                       2u
#define SAI_RCR_SYNC(x)                          (((uint32_t)(((uint32_t)(x))<<SAI_RCR_SYNC_SHIFT))&SAI_RCR_SYNC_MASK)
/* RDR Bit Fields */
#define SAI_RDR_RDR_MASK                         0xFFFFFFFFu
#define SAI_RDR_RDR_SHIFT                        0u
#define SAI_RDR_RDR_WIDTH                        32u
#define SAI_RDR_RDR(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RDR_RDR_SHIFT))&SAI_RDR_RDR_MASK)
/* RFR Bit Fields */
#define SAI_RFR_RFP_MASK                         0xFu
#define SAI_RFR_RFP_SHIFT                        0u
#define SAI_RFR_RFP_WIDTH                        4u
#define SAI_RFR_RFP(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RFR_RFP_SHIFT))&SAI_RFR_RFP_MASK)
#define SAI_RFR_RCP_MASK                         0x8000u
#define SAI_RFR_RCP_SHIFT                        15u
#define SAI_RFR_RCP_WIDTH                        1u
#define SAI_RFR_RCP(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RFR_RCP_SHIFT))&SAI_RFR_RCP_MASK)
#define SAI_RFR_WFP_MASK                         0xF0000u
#define SAI_RFR_WFP_SHIFT                        16u
#define SAI_RFR_WFP_WIDTH                        4u
#define SAI_RFR_WFP(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RFR_WFP_SHIFT))&SAI_RFR_WFP_MASK)
/* RMR Bit Fields */
#define SAI_RMR_RWM_MASK                         0xFFFFu
#define SAI_RMR_RWM_SHIFT                        0u
#define SAI_RMR_RWM_WIDTH                        16u
#define SAI_RMR_RWM(x)                           (((uint32_t)(((uint32_t)(x))<<SAI_RMR_RWM_SHIFT))&SAI_RMR_RWM_MASK)

/*!
 * @}
 */ /* end of group SAI_Register_Masks */


/*!
 * @}
 */ /* end of group SAI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SCG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCG_Peripheral_Access_Layer SCG Peripheral Access Layer
 * @{
 */


/** SCG - Size of Registers Arrays */

